GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f45k42.inc
;----- INLVLD Bits -----------------------------------------------------
INLVLD0          EQU  H'0000'
INLVLD1          EQU  H'0001'
INLVLD2          EQU  H'0002'
INLVLD3          EQU  H'0003'
INLVLD4          EQU  H'0004'
INLVLD5          EQU  H'0005'
INLVLD6          EQU  H'0006'
INLVLD7          EQU  H'0007'


;----- CCDPD Bits -----------------------------------------------------
CCDPD0           EQU  H'0000'
CCDPD1           EQU  H'0001'
CCDPD2           EQU  H'0002'
CCDPD3           EQU  H'0003'
CCDPD4           EQU  H'0004'
CCDPD5           EQU  H'0005'
CCDPD6           EQU  H'0006'
CCDPD7           EQU  H'0007'


;----- CCDND Bits -----------------------------------------------------
CCDND0           EQU  H'0000'
CCDND1           EQU  H'0001'
CCDND2           EQU  H'0002'
CCDND3           EQU  H'0003'
CCDND4           EQU  H'0004'
CCDND5           EQU  H'0005'
CCDND6           EQU  H'0006'
CCDND7           EQU  H'0007'


;----- RD0I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'

TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'

I2CSLEW          EQU  H'0006'

I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'


;----- RD1I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'

TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'

I2CSLEW          EQU  H'0006'

I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'


;----- ANSELE Bits -----------------------------------------------------
ANSELE0          EQU  H'0000'
ANSELE1          EQU  H'0001'
ANSELE2          EQU  H'0002'


;----- WPUE Bits -----------------------------------------------------
WPUE0            EQU  H'0000'
WPUE1            EQU  H'0001'
WPUE2            EQU  H'0002'
WPUE3            EQU  H'0003'


;----- ODCONE Bits -----------------------------------------------------
ODCE0            EQU  H'0000'
ODCE1            EQU  H'0001'
ODCE2            EQU  H'0002'


;----- SLRCONE Bits -----------------------------------------------------
SLRE0            EQU  H'0000'
SLRE1            EQU  H'0001'
SLRE2            EQU  H'0002'


;----- INLVLE Bits -----------------------------------------------------
INLVLE0          EQU  H'0000'
INLVLE1          EQU  H'0001'
INLVLE2          EQU  H'0002'
INLVLE3          EQU  H'0003'


;----- IOCEP Bits -----------------------------------------------------
IOCEP3           EQU  H'0003'


;----- IOCEN Bits -----------------------------------------------------
IOCEN3           EQU  H'0003'


;----- IOCEF Bits -----------------------------------------------------
IOCEF3           EQU  H'0003'


;----- CCDPE Bits -----------------------------------------------------
CCDPE0           EQU  H'0000'
CCDPE1           EQU  H'0001'
CCDPE2           EQU  H'0002'


;----- CCDNE Bits -----------------------------------------------------
CCDNE0           EQU  H'0000'
CCDNE1           EQU  H'0001'
CCDNE2           EQU  H'0002'


;----- CCDCON Bits -----------------------------------------------------
EN               EQU  H'0007'

CCDEN            EQU  H'0007'

SEL0             EQU  H'0000'
SEL1             EQU  H'0001'


;----- PPSLOCK Bits -----------------------------------------------------
PPSLOCKED        EQU  H'0000'


;----- DMA2BUF Bits -----------------------------------------------------
BUF0             EQU  H'0000'
BUF1             EQU  H'0001'
BUF2             EQU  H'0002'
BUF3             EQU  H'0003'
BUF4             EQU  H'0004'
BUF5             EQU  H'0005'
BUF6             EQU  H'0006'
BUF7             EQU  H'0007'


DMA2BUF0         EQU  H'0000'
DMA2BUF1         EQU  H'0001'
DMA2BUF2         EQU  H'0002'
DMA2BUF3         EQU  H'0003'
DMA2BUF4         EQU  H'0004'
DMA2BUF5         EQU  H'0005'
DMA2BUF6         EQU  H'0006'
DMA2BUF7         EQU  H'0007'


;----- DMA2DCNTL Bits -----------------------------------------------------
DCNT0            EQU  H'0000'
DCNT1            EQU  H'0001'
DCNT2            EQU  H'0002'
DCNT3            EQU  H'0003'
DCNT4            EQU  H'0004'
DCNT5            EQU  H'0005'
DCNT6            EQU  H'0006'
DCNT7            EQU  H'0007'


DMA2DCNT0        EQU  H'0000'
DMA2DCNT1        EQU  H'0001'
DMA2DCNT2        EQU  H'0002'
DMA2DCNT3        EQU  H'0003'
DMA2DCNT4        EQU  H'0004'
DMA2DCNT5        EQU  H'0005'
DMA2DCNT6        EQU  H'0006'
DMA2DCNT7        EQU  H'0007'


;----- DMA2DCNTH Bits -----------------------------------------------------
DCNT8            EQU  H'0000'
DCNT9            EQU  H'0001'
DCNT10           EQU  H'0002'
DCNT11           EQU  H'0003'


DMA2DCNT8        EQU  H'0000'
DMA2DCNT9        EQU  H'0001'
DMA2DCNT10       EQU  H'0002'
DMA2DCNT11       EQU  H'0003'


;----- DMA2DPTRL Bits -----------------------------------------------------
DPTR0            EQU  H'0000'
DPTR1            EQU  H'0001'
DPTR2            EQU  H'0002'
DPTR3            EQU  H'0003'
DPTR4            EQU  H'0004'
DPTR5            EQU  H'0005'
DPTR6            EQU  H'0006'
DPTR7            EQU  H'0007'


DMA2DPTR0        EQU  H'0000'
DMA2DPTR1        EQU  H'0001'
DMA2DPTR2        EQU  H'0002'
DMA2DPTR3        EQU  H'0003'
DMA2DPTR4        EQU  H'0004'
DMA2DPTR5        EQU  H'0005'
DMA2DPTR6        EQU  H'0006'
DMA2DPTR7        EQU  H'0007'


;----- DMA2DPTRH Bits -----------------------------------------------------
DPTR8            EQU  H'0000'
DPTR9            EQU  H'0001'
DPTR10           EQU  H'0002'
DPTR11           EQU  H'0003'
DPTR12           EQU  H'0004'
DPTR13           EQU  H'0005'
DPTR14           EQU  H'0006'
DPTR15           EQU  H'0007'


DMA2DPTR8        EQU  H'0000'
DMA2DPTR9        EQU  H'0001'
DMA2DPTR10       EQU  H'0002'
DMA2DPTR11       EQU  H'0003'
DMA2DPTR12       EQU  H'0004'
DMA2DPTR13       EQU  H'0005'
DMA2DPTR14       EQU  H'0006'
DMA2DPTR15       EQU  H'0007'


;----- DMA2DSZL Bits -----------------------------------------------------
DSZ0             EQU  H'0000'
DSZ1             EQU  H'0001'
DSZ2             EQU  H'0002'
DSZ3             EQU  H'0003'
DSZ4             EQU  H'0004'
DSZ5             EQU  H'0005'
DSZ6             EQU  H'0006'
DSZ7             EQU  H'0007'

DMA2DSZ0         EQU  H'0000'
DMA2DSZ1         EQU  H'0001'
DMA2DSZ2         EQU  H'0002'
DMA2DSZ3         EQU  H'0003'
DMA2DSZ4         EQU  H'0004'
DMA2DSZ5         EQU  H'0005'
DMA2DSZ6         EQU  H'0006'
DMA2DSZ7         EQU  H'0007'


;----- DMA2DSZH Bits -----------------------------------------------------
DSZ8             EQU  H'0000'
DSZ9             EQU  H'0001'
DSZ10            EQU  H'0002'
DSZ11            EQU  H'0003'

DMA2DSZ8         EQU  H'0000'
DMA2DSZ9         EQU  H'0001'
DMA2DSZ10        EQU  H'0002'
DMA2DSZ11        EQU  H'0003'


;----- DMA2DSAL Bits -----------------------------------------------------
SSA0             EQU  H'0000'
SSA1             EQU  H'0001'
SSA2             EQU  H'0002'
SSA3             EQU  H'0003'
SSA4             EQU  H'0004'
SSA5             EQU  H'0005'
SSA6             EQU  H'0006'
SSA7             EQU  H'0007'


DMA2DSA0         EQU  H'0000'
DMA2DSA1         EQU  H'0001'
DMA2DSA2         EQU  H'0002'
DMA2DSA3         EQU  H'0003'
DMA2DSA4         EQU  H'0004'
DMA2DSA5         EQU  H'0005'
DMA2DSA6         EQU  H'0006'
DMA2DSA7         EQU  H'0007'


